In [1]:
import pandas as pd

## File

In [24]:
df = pd.read_csv('train.csv')

In [25]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
df = pd.read_excel('Employee data.xls', sheet_name=0)

In [27]:
df.head()

,id,gender,bdate,educ,jobcat,salary,salbegin,jobtime,prevexp,minority
0,1,m,1952-02-03,15,3,57000,27000,98,144,0
1,2,m,1958-05-23,16,1,40200,18750,98,36,0
2,3,f,1929-07-26,12,1,21450,12000,98,381,0
3,4,f,1947-04-15,8,1,21900,13200,98,190,0
4,5,m,1955-02-09,15,1,45000,21000,98,138,0

## Database

In [ ]:
from sqlalchemy import create_engine
uri = 'mongodb://ufk2vps0a7j:p7bb9de7d5fa58cb72a105ae756813ba7'
      '@ec2-38-129-168-191.compute-1.amazonaws.com:5432/deu4neob640'
engine = create_engine(uri)
conn = engine.raw_connection()

In [20]:
import sqlite3
conn = sqlite3.connect("flights.db")
# airports, airlines, and routes

In [21]:
query = "SELECT * FROM airports"

In [22]:
df = pd.read_sql_query(query, con=conn)

In [23]:
df.head()

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

## API

In [50]:
import requests
api_key = '3e3549aba4a6d288ce'
endpoint = f'http://www.apilayer.net/api/live?access_key={api_key}&format=1'

In [51]:
response = requests.get(endpoint)
response.status_code

200

In [53]:
import json
json_string = response.content.decode('utf-8')
data = json.loads(json_string)

In [54]:
data.keys()

dict_keys(['success', 'terms', 'privacy', 'timestamp', 'source', 'quotes'])

In [70]:
df = pd.DataFrame()
df['Currency'] = data['quotes'].keys()
df['Exchange Rate'] = data['quotes'].values()
df['Timestamp'] = data['timestamp']

In [71]:
df.head()

  Currency  Exchange Rate   Timestamp
0   USDAED       3.673150  1548837546
1   USDAFN      75.764505  1548837546
2   USDALL     109.000097  1548837546
3   USDAMD     486.040074  1548837546
4   USDANG       1.785250  1548837546

In [72]:
df.Currency.apply(len).value_counts()

6    168
Name: Currency, dtype: int64

In [75]:
df['Source'] = df.Currency.apply(lambda x: x[:3])
df['Target'] = df.Currency.apply(lambda x: x[3:])
df['Date'] =  pd.to_datetime(df.Timestamp, unit='s', utc=True)

In [76]:
df.head()

  Currency  Exchange Rate   Timestamp Source Target                      Date
0   USDAED       3.673150  1548837546    USD    AED 2019-01-30 08:39:06+00:00
1   USDAFN      75.764505  1548837546    USD    AFN 2019-01-30 08:39:06+00:00
2   USDALL     109.000097  1548837546    USD    ALL 2019-01-30 08:39:06+00:00
3   USDAMD     486.040074  1548837546    USD    AMD 2019-01-30 08:39:06+00:00
4   USDANG       1.785250  1548837546    USD    ANG 2019-01-30 08:39:06+00:00

In [77]:
df['Date'] = df.Date.dt.strftime('%Y-%m-%d')

In [78]:
df.head()

  Currency  Exchange Rate   Timestamp Source Target        Date
0   USDAED       3.673150  1548837546    USD    AED  2019-01-30
1   USDAFN      75.764505  1548837546    USD    AFN  2019-01-30
2   USDALL     109.000097  1548837546    USD    ALL  2019-01-30
3   USDAMD     486.040074  1548837546    USD    AMD  2019-01-30
4   USDANG       1.785250  1548837546    USD    ANG  2019-01-30

## Web Scraping

In [79]:
import requests
website = 'http://www.hubertiming.com/results/2017GPTR10K'

In [86]:
response = requests.get(website)
response.status_code

200

In [87]:
from bs4 import BeautifulSoup
html = BeautifulSoup(response.content, 'lxml')

In [106]:
individual_results = html.find(attrs={
    'id': 'individualResults'
})

In [108]:
table_headers = individual_results.find_all('th')
table_headers = [h.text for h in table_headers]

In [109]:
table_headers

['Place',
 'Bib',
 'Name',
 'Gender',
 'City',
 'State',
 'Chip Time',
 'Chip Pace',
 'Gender Place',
 'Age Group',
 'Age Group Place',
 'Time to Start',
 'Gun Time',
 'Team']

In [112]:
table_rows = individual_results.find_all('tr')

In [113]:
data = [[element.text for element in row.find_all('td')] for row in table_rows]

In [115]:
df = pd.DataFrame(data)

In [121]:
df.columns = table_headers

In [119]:
df.drop(0, axis=0, inplace=True)

In [122]:
df.head()

,Place,Bib,Name,Gender,City,State,Chip Time,Chip Pace,Gender Place,Age Group,Age Group Place,Time to Start,Gun Time,Team
1,1,814,JARED WILSON,M,TIGARD,OR,00:36:21,05:51,1 of 414,M 36-45,1 of 152,00:00:03,00:36:24,
2,2,573,NATHAN A SUSTERSIC,M,PORTLAND,OR,00:36:42,05:55,2 of 414,M 26-35,1 of 154,00:00:03,00:36:45,INTEL TEAM F
3,3,687,FRANCISCO MAYA,M,PORTLAND,OR,00:37:44,06:05,3 of 414,M 46-55,1 of 64,00:00:04,00:37:48,
4,4,623,PAUL MORROW,M,BEAVERTON,OR,00:38:34,06:13,4 of 414,M 36-45,2 of 152,00:00:03,00:38:37,
5,5,569,DEREK G OSBORNE,M,HILLSBORO,OR,00:39:21,06:20,5 of 414,M 26-35,2 of 154,00:00:03,00:39:24,INTEL TEAM F